DanielR92/CMT2300A/RP2040/main.cpp
        #ifdef RP2040
        if((state & 0x10) == 0x10) {
            while(0 == gpio_get(CMT_GPIO3)) {
                usleep(10);
                if(0 == --timeout) {
                    //Serial.println("GPIO timeout");
                    break;
                }
            }
            if(0 != timeout) {
                uint16_t timeout2 = 5000;
                while(0x18 != (state & 0x18)) {
                    state = spi3w.readReg(CMT2300A_CUS_INT_FLAG);
                    if(0 == timeout2--) {
                        //Serial.println("state timeout");
                        break;
                    }
                }
            }
        }
        #endif


        if(0 != gpio_get(CMT_GPIO3)) {
            uint32_t loops = 0;
            while((state & 0x1b) != 0x1b) {
                state = spi3w.readReg(CMT2300A_CUS_INT_FLAG);

                //if(state == 0x18)
                //    delay(23);

                if((state & 0x20) == 0x20) {
                    Serial.println("receive PKT ERROR");
                    break;
                }
                else if((state & 0x40) == 0x40) {
                    Serial.println("receive COL ERROR");
                    break;
                }

                if(++loops > 5000) {
                    //Serial.println("receive error, loops, state: " + String(state, HEX));
                    break;
                }
            }
        }


        // receive ok (pream, sync, node, crc)
        uint8_t buf[28] = {0};
        if((state & 0x1b) == 0x1b) {
            if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
                Serial.println("warn: not switched to standby mode!");

            spi3w.readFifo(buf, 28);

            rssi = spi3w.readReg(CMT2300A_CUS_RSSI_DBM) - 128;

            if(!cmtSwitchStatus(CMT2300A_GO_SLEEP, CMT2300A_STA_SLEEP))
                Serial.println("warn: not switched to sleep mode!");
        }

        /*if(0 != timeout)
            Serial.println("RX DONE!!! RSSI: " + String(rssi) + " remain cnt: " + String(timeout));
*/
        if((state & 0x1b) == 0x1b) {
            //Serial.println("mLastFreq: " + String(mLastFreq, HEX));
            dumpBuf("RX", &buf[1], 27, false);

            //Serial.print(", RSSI: " + String(rssi));

            uint8_t len = buf[0] + 1;
            buf[len-0] = 0x00;
            if(buf[0] == 0x1b) {
                buf[len-2] = 0x00;
                buf[len-1] = 0x00;
                uint16_t crc2 = crc16(&buf[11], len-13, 0xffff);
                Serial.print(", crc16: " + String(crc2, HEX));
                buf[len-3] = (crc2 >> 8 & 0xff);
                buf[len-2] = (crc2      & 0xff);
            }
            Serial.println(", crc8: " + String(crc8(&buf[1], len-1), HEX));
        }
    //}


    if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
        Serial.println("warn: not switched to standby mode!");

    return rssi;
}

//-----------------------------------------------------------------------------
void txData(uint8_t buf[], uint8_t len, bool calcCrc16 = true, bool calcCrc8 = true, bool verify = false) {
    // prepare buf
    if(calcCrc16) {
        buf[len-3] = 0x00;
        buf[len-2] = 0x00;
        buf[len-1] = 0x00;
        uint16_t crc2 = crc16(&buf[10], len-13, 0xffff);
        buf[len-3] = (crc2 >> 8 & 0xff);
        buf[len-2] = (crc2      & 0xff);
    }
    if(calcCrc8)
        buf[len-1] = crc8(buf, len-1);
    dumpBuf("TX", buf, len);

    // verify that write pipe is empty
    if(verify == true) {
        spi3w.writeReg(0x16, 0x04); // [4:3]: RSSI_DET_SEL, [2:0]: RSSI_AVG_MODE
        spi3w.writeReg(CMT2300A_CUS_FREQ_CHNL, 0x00);

        if(!cmtSwitchStatus(CMT2300A_GO_RX, CMT2300A_STA_RX))
            Serial.println("warn: cant reach RX mode!");

        for(uint8_t i = 0; i < 50; i++) {
            spi3w.readReg(CMT2300A_CUS_RSSI_DBM);
            spi3w.readReg(CMT2300A_CUS_INT1_CTL);
            if(0x00 != spi3w.readReg(CMT2300A_CUS_INT_FLAG)) {
                Serial.println("TX: CMT2300A_CUS_INT_FLAG is not 0!: " + String(spi3w.readReg(CMT2300A_CUS_INT_FLAG), HEX));

                spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x00);
                spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x00);
                return;
            }
            spi3w.readReg(CMT2300A_CUS_INT_CLR1);
            spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x00);
            spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x00);
        }

        if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
            Serial.println("warn: not switched to standby mode!");
        // verify end
    }

    //if(CMT2300A_INT_SEL_TX_DONE != spi3w.readReg(CMT2300A_CUS_INT1_CTL))
    //    spi3w.writeReg(CMT2300A_CUS_INT1_CTL, CMT2300A_INT_SEL_TX_DONE);
    spi3w.readReg(CMT2300A_CUS_INT1_CTL);
    spi3w.writeReg(CMT2300A_CUS_INT1_CTL, CMT2300A_INT_SEL_TX_DONE);

    //if(0x00 == spi3w.readReg(CMT2300A_CUS_INT_FLAG))
    {
        // no data received
        spi3w.readReg(CMT2300A_CUS_INT_CLR1);
        spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x00);
        spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x00);

        spi3w.readReg(CMT2300A_CUS_FIFO_CTL); // necessary?
        spi3w.writeReg(CMT2300A_CUS_FIFO_CTL, 0x07);

        spi3w.writeReg(CMT2300A_CUS_FIFO_CLR, 0x01);

        if(0x01 != spi3w.readReg(0x45))
            Serial.println("reg 0x45 must be 0x01!");
        spi3w.writeReg(0x45, 0x01);
        spi3w.writeReg(0x46, len); // payload length

        spi3w.writeFifo(buf, len);

        //spi3w.writeReg(CMT2300A_CUS_FREQ_CHNL, mLastFreq);
        spi3w.writeReg(CMT2300A_CUS_FREQ_CHNL, 0x00);

        if(!cmtSwitchStatus(CMT2300A_GO_TX, CMT2300A_STA_TX))
            Serial.println("warn: cant reach TX mode!");

        // wait for tx done
        while(CMT2300A_MASK_TX_DONE_FLG != spi3w.readReg(CMT2300A_CUS_INT_CLR1)) {
            yield();
            //sleep_us(10);
        }

        delay(1);

        if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
            Serial.println("warn: not switched to standby mode!");
    }
}

