DanielR92/CMT2300A/RP2040/main.cpp
    #ifdef RP2040
    gpio_init(CMT_GPIO3);
    gpio_set_dir(CMT_GPIO3, false); // INPUT
    #endif

    delay(1000);
    Serial.println("start");

    spi3w.writeReg(0x00, 0xff);
    delay(20);

    resetCMT();

    mPrevMillis = millis();
}

//-----------------------------------------------------------------------------
/*void rxLoop(void) {
    int8_t rssi = rxInit();
    int8_t rssiNew = rssi;
    for(uint8_t i = 0; i < 100; i++) {
        rssiNew = checkRx();
        if(rssiNew != rssi) {
            if(-128 != rssiNew) {
                rssi = rssiNew;
                Serial.println("RSSI: " + String(rssi) + " Freq: " + mLastFreq);
            }
        }
    }
}*/

//-----------------------------------------------------------------------------
void loop() {
    if ((millis() - mPrevMillis) > 1000) {
        mPrevMillis = millis();
        cnt++;

        //Serial.println("#" + String(cnt) + ": ");
        if(!mFound) {
            if(cnt < 5) {
                uint8_t cfg1[15] = {
                    0x56, U32_B3(wr), U32_B2(wr), U32_B1(wr), U32_B0(wr), U32_B3(dtu), U32_B2(dtu), U32_B1(dtu),
                    U32_B0(dtu), 0x02, 0x15, 0x21, 0x0f, 0x14, 0x62
                };
                //txData(cfg1, 15, false, true, mTxVerify);
                mTxVerify = false;
            }
        }

        if(((ts % 2) == 0) && (cnt > 5)) {
            uint8_t rqst[27] = {
                0x15, U32_B3(wr), U32_B2(wr), U32_B1(wr), U32_B0(wr), U32_B3(dtu), U32_B2(dtu), U32_B1(dtu),
                U32_B0(dtu), 0x80, 0x0B, 0x00, U32_B3(ts), U32_B2(ts), U32_B1(ts), U32_B0(ts),
                0x00, 0x00, 0x00, 0x1C, 0x00, 0x00, 0x00, 0x00,
                0x00, 0x00, 0x00
            };
            txData(rqst, 27);
        }
        ts++;
    }
    checkRx();
}
